/* Задание 1: Последователно и двоично търсене в масив
Да се напише програма, с която изтривате въведен от потребителя елемент от сортиран целочислен масив.
*/

#include <iostream>
#include <windows.h>

using namespace std;
/*
Упътване:
1. Въведете елементите на масива
2. Намерете търсения елемент в сортирания масив, използвайки двоично търсене
3. Ако елементът е намерен, преминете към т. 4, в противен случай преминете към т. 6
4. Изтрийте намерения елемент. За да изтриете елемент от масив преместете с една позиция наляво  всички елементи след него.
5. Изведете елементите на масива
6. Край
*/

int main()
{
    int array[] = { 1,3,5,7,9,11,113 };
    int n = 7;
    int pos = 0;
    bool flag =false;
    int x;

    cout << "Array:";
    for (int z = 0; z < n; z++)
        cout << array[z] << " ";

    cout << endl;
    cout << "Delete x = ";
    cin >> x;

    for (int i = 0; i < n; i++) {
        pos++;
        if (array[i] == x)   //ако бъде намерено съвпадение
        {
            flag = true;   // вдигане на флага
            break;    // излизане от цикъла
        }
    }
    if (flag)    // проверка дали е намерен елементът
        cout << "Deleted Position: "<<pos;
    else
        cout << " Not Found";


    for (int i = pos - 1; i < n; i++) {
        array[i] = array[i + 1];
    }
    n--;

    cout << endl;
    cout << "New Array:";
    for (int i = 0; i < n; i++) {
        cout << array[i] << " ";
    }
    
    return 0;
}
