/* Задание 1: Алгоритми за сортиране
1. Едно от подобренията на алгоритъма за сортиране по метода на мехурчето е за  всяко обхождане  да се проверява дали е направена поне една размяна.
Това може да стане с една променлива напр. sortiran, която е от тип bool. Ако има поне една размяна (sortiran=false),
тогава се прави следващо обхождане. По този начин се елиминира излишното обхождане на масива ако сортирането се реализира преди n-1 стъпка.
Реализирайте подобрения алгоритъм.
*/
#include <iostream>
using namespace std;

int main() {
    int n=10;
    int arr[10] = {0,9,8,7,6,5,4,3,2,1};
    bool sorted;

    for (int i = 0; i < n - 1; ++i) {
        sorted = true;

        for (int j = 0; j < n - i - 1; ++j) {
            if (arr[j] > arr[j + 1]) {  
                int temp = arr[j];
                arr[j] = arr[j + 1];
                arr[j + 1] = temp;        
                sorted = false;
            }
        }
        if (sorted) break;
    }

    for (int i = 0; i < n; ++i) {
        cout << arr[i] << " ";
    }                           
    cout << endl; 

    return 0;
}